## Install PyMySQL---------> pip install PyMySQL
## Install sqlalchemy------> pip install sqlalchemy

In [30]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

cnx = create_engine('mysql+pymysql://root:shiv1111@127.0.0.1/practice')    
df = pd.read_sql('SELECT * FROM customers', cnx) #read the entire table
df

,Customer_ID,Customer_Name,Customer_Contact,Address,City,Salary,date
0,1,SS,1345,Solapur,Solapur,25000,2021-01-05
1,2,SM,1145,Hyderabad,Q-City,2500,2022-04-06
2,3,KK,1000,Mumbai,Nan,22200,2022-06-07
3,4,KS,2000,Mumbai,Sangam,1111,2021-06-06
4,5,MSE,5000,Davangere,Kirik,144921,2020-02-06
5,6,Sanu,999,Mysore,Bengaluru,1931,2000-02-06
6,7,SSS,101010,Solapur,Chowk,25000,2022-06-13

In [72]:
df_append=pd.DataFrame({"Customer_ID":8,"Customer_Name":"Shivashankar","Customer_Contact":1001010,
                        "Address":"Saiful","City":"Solapur","Salary":55500,"date":"2021-01-05"},index=[7])
df_append

,Customer_ID,Customer_Name,Customer_Contact,Address,City,Salary,date
7,8,Shivashankar,1001010,Saiful,Solapur,55500,2021-01-05

In [73]:
query='''Select Customer_Name from customers where Customer_ID<5'''
df=pd.read_sql_query(query,cnx)
df

  Customer_Name
0            SS
1            SM
2            KK
3            KS

In [74]:
q='''Select *from Customers where Salary Between 2500 AND 10000;'''
df1=pd.read_sql_query(q,cnx)
df1

,Customer_ID,Customer_Name,Customer_Contact,Address,City,Salary,date
0,2,SM,1145,Hyderabad,Q-City,2500,2022-04-06

##### Write data into SQL Table

In [75]:
df_append.to_sql(name='customers',con=cnx,index=False,if_exists='append')